src/main/java/ok/dht/test/scheredin/report/stage_2/wrk_output_single_thread
 wrk2 -R 600 -c 32 -t 4 -d 60s -s /Users/artem.scheredin/projects/technop/highload/src/main/java/ok/dht/test/scheredin/report/scripts/get.lua  -L http://localhost:19234 && sleep 20 && wrk2 -R 40500 -c 32 -t 4 -d 60s -s /Users/artem.scheredin/projects/technop/highload/src/main/java/ok/dht/test/scheredin/report/scripts/put.lua  -L http://localhost:19234

Running 1m test @ http://localhost:19234
  4 threads and 32 connections
  Thread calibration: mean lat.: 4.511ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 4.604ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.503ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 4.639ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    4.28ms  34.66ms   88.88%
    Req/Sec   152.79     50.38   320.00     61.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.37ms
 75.000%    1.85ms
 90.000%   11.18ms
 99.000%   21.20ms
 99.900%   25.33ms
 99.990%   31.45ms
 99.999%   34.69ms
100.000%   34.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.145     0.000000            1         1.00
       0.688     0.100000         3002         1.11
       0.905     0.200000         6003         1.25
       1.075     0.300000         9004         1.43
       1.224     0.400000        12009         1.67
       1.368     0.500000        14999         2.00
       1.443     0.550000        16496         2.22
       1.526     0.600000        17992         2.50
       1.615     0.650000        19486         2.86
       1.719     0.700000        20986         3.33
       1.847     0.750000        22485         4.00
       1.927     0.775000        23233         4.44
       2.016     0.800000        23981         5.00
       2.137     0.825000        24738         5.71
       2.307     0.850000        25480         6.67
       2.713     0.875000        26226         8.00
       6.575     0.887500        26602         8.89
      11.175     0.900000        26975        10.00
      12.095     0.912500        27352        11.43
      12.639     0.925000        27728        13.33
      13.119     0.937500        28104        16.00
      13.327     0.943750        28287        17.78
      13.599     0.950000        28474        20.00
      13.911     0.956250        28663        22.86
      14.271     0.962500        28850        26.67
      14.759     0.968750        29039        32.00
      15.015     0.971875        29132        35.56
      15.375     0.975000        29223        40.00
      15.727     0.978125        29318        45.71
      16.127     0.981250        29411        53.33
      16.607     0.984375        29505        64.00
      17.311     0.985938        29551        71.11
      19.887     0.987500        29598        80.00
      20.927     0.989062        29645        91.43
      21.551     0.990625        29692       106.67
      22.303     0.992188        29739       128.00
      22.575     0.992969        29762       142.22
      22.831     0.993750        29785       160.00
      23.071     0.994531        29809       182.86
      23.311     0.995313        29832       213.33
      23.551     0.996094        29855       256.00
      23.727     0.996484        29868       284.44
      23.919     0.996875        29880       320.00
      24.063     0.997266        29891       365.71
      24.383     0.997656        29902       426.67
      24.543     0.998047        29915       512.00
      24.751     0.998242        29920       568.89
      24.927     0.998437        29926       640.00
      24.991     0.998633        29932       731.43
      25.263     0.998828        29937       853.33
      25.407     0.999023        29943      1024.00
      25.599     0.999121        29946      1137.78
      25.663     0.999219        29949      1280.00
      25.919     0.999316        29953      1462.86
      26.015     0.999414        29955      1706.67
      26.143     0.999512        29958      2048.00
      26.303     0.999561        29959      2275.56
      26.687     0.999609        29961      2560.00
      27.215     0.999658        29962      2925.71
      29.695     0.999707        29964      3413.33
      29.711     0.999756        29965      4096.00
      29.983     0.999780        29966      4551.11
      30.303     0.999805        29967      5120.00
      30.303     0.999829        29967      5851.43
      31.071     0.999854        29968      6826.67
      31.455     0.999878        29969      8192.00
      31.455     0.999890        29969      9102.22
      32.399     0.999902        29970     10240.00
      32.399     0.999915        29970     11702.86
      32.399     0.999927        29970     13653.33
      33.183     0.999939        29971     16384.00
      33.183     0.999945        29971     18204.44
      33.183     0.999951        29971     20480.00
      33.183     0.999957        29971     23405.71
      33.183     0.999963        29971     27306.67
      34.687     0.999969        29972     32768.00
      34.687     1.000000        29972          inf
#[Mean    =        2.776, StdDeviation   =        4.281]
#[Max     =       34.656, Total count    =        29972]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36004 requests in 1.00m, 2.25MB read
Requests/sec:    600.03
Transfer/sec:     38.44KB
Running 1m test @ http://localhost:19234
  4 threads and 32 connections
  Thread calibration: mean lat.: 4.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.859ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.770ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21ms  585.36us  11.66ms   67.45%
    Req/Sec    10.68k   796.71    18.89k    71.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.59ms
 90.000%    1.97ms
 99.000%    2.62ms
 99.900%    3.36ms
 99.990%    9.98ms
 99.999%   10.90ms
100.000%   11.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.050     0.000000            4         1.00
       0.478     0.100000       202757         1.11
       0.692     0.200000       405747         1.25
       0.863     0.300000       607936         1.43
       1.017     0.400000       809658         1.67
       1.168     0.500000      1012347         2.00
       1.244     0.550000      1113130         2.22
       1.323     0.600000      1214124         2.50
       1.407     0.650000      1315902         2.86
       1.496     0.700000      1417377         3.33
       1.593     0.750000      1518329         4.00
       1.645     0.775000      1568390         4.44
       1.701     0.800000      1619380         5.00
       1.760     0.825000      1669710         5.71
       1.824     0.850000      1720082         6.67
       1.895     0.875000      1770696         8.00
       1.933     0.887500      1795848         8.89
       1.974     0.900000      1821383        10.00
       2.018     0.912500      1846642        11.43
       2.067     0.925000      1871857        13.33
       2.123     0.937500      1897424        16.00
       2.153     0.943750      1909744        17.78
       2.187     0.950000      1922427        20.00
       2.225     0.956250      1935106        22.86
       2.267     0.962500      1947526        26.67
       2.319     0.968750      1960542        32.00
       2.347     0.971875      1966507        35.56
       2.379     0.975000      1972857        40.00
       2.417     0.978125      1979394        45.71
       2.457     0.981250      1985448        53.33
       2.507     0.984375      1991945        64.00
       2.533     0.985938      1994929        71.11
       2.565     0.987500      1998205        80.00
       2.599     0.989062      2001291        91.43
       2.639     0.990625      2004543       106.67
       2.683     0.992188      2007615       128.00
       2.709     0.992969      2009188       142.22
       2.739     0.993750      2010753       160.00
       2.771     0.994531      2012304       182.86
       2.809     0.995313      2013917       213.33
       2.853     0.996094      2015495       256.00
       2.879     0.996484      2016273       284.44
       2.909     0.996875      2017046       320.00
       2.945     0.997266      2017863       365.71
       2.989     0.997656      2018625       426.67
       3.049     0.998047      2019435       512.00
       3.085     0.998242      2019820       568.89
       3.133     0.998437      2020210       640.00
       3.191     0.998633      2020606       731.43
       3.263     0.998828      2021005       853.33
       3.373     0.999023      2021395      1024.00
       3.461     0.999121      2021590      1137.78
       3.603     0.999219      2021787      1280.00
       3.801     0.999316      2021986      1462.86
       4.065     0.999414      2022182      1706.67
       4.383     0.999512      2022380      2048.00
       4.583     0.999561      2022478      2275.56
       4.875     0.999609      2022578      2560.00
       5.219     0.999658      2022676      2925.71
       6.007     0.999707      2022775      3413.33
       7.055     0.999756      2022876      4096.00
       7.623     0.999780      2022923      4551.11
       8.187     0.999805      2022972      5120.00
       8.775     0.999829      2023022      5851.43
       9.279     0.999854      2023071      6826.67
       9.719     0.999878      2023121      8192.00
       9.871     0.999890      2023148      9102.22
       9.975     0.999902      2023171     10240.00
      10.127     0.999915      2023195     11702.86
      10.207     0.999927      2023219     13653.33
      10.399     0.999939      2023244     16384.00
      10.463     0.999945      2023260     18204.44
      10.519     0.999951      2023269     20480.00
      10.575     0.999957      2023283     23405.71
      10.615     0.999963      2023293     27306.67
      10.663     0.999969      2023306     32768.00
      10.695     0.999973      2023312     36408.89
      10.719     0.999976      2023319     40960.00
      10.735     0.999979      2023324     46811.43
      10.751     0.999982      2023331     54613.33
      10.815     0.999985      2023337     65536.00
      10.855     0.999986      2023340     72817.78
      10.879     0.999988      2023344     81920.00
      10.895     0.999989      2023346     93622.86
      10.903     0.999991      2023349    109226.67
      10.943     0.999992      2023352    131072.00
      10.967     0.999993      2023354    145635.56
      10.975     0.999994      2023355    163840.00
      10.991     0.999995      2023357    187245.71
      11.095     0.999995      2023358    218453.33
      11.167     0.999996      2023360    262144.00
      11.191     0.999997      2023361    291271.11
      11.191     0.999997      2023361    327680.00
      11.247     0.999997      2023362    374491.43
      11.263     0.999998      2023363    436906.67
      11.439     0.999998      2023364    524288.00
      11.439     0.999998      2023364    582542.22
      11.439     0.999998      2023364    655360.00
      11.543     0.999999      2023365    748982.86
      11.543     0.999999      2023365    873813.33
      11.599     0.999999      2023366   1048576.00
      11.599     0.999999      2023366   1165084.44
      11.599     0.999999      2023366   1310720.00
      11.599     0.999999      2023366   1497965.71
      11.599     0.999999      2023366   1747626.67
      11.663     1.000000      2023367   2097152.00
      11.663     1.000000      2023367          inf
#[Mean    =        1.209, StdDeviation   =        0.585]
#[Max     =       11.656, Total count    =      2023367]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2429224 requests in 1.00m, 155.22MB read
Requests/sec:  40487.87
Transfer/sec:      2.59MB